# На вход программе подается одно число nn. Напишите программу,
# которая выводит список [1, 2, 3, ..., n].
#
# Формат входных данных
# На вход программе подается одно натуральное число.
#
# Формат выходных данных
# Программа должна вывести текст в соответствии с условием задачи.

print(list(range(1, int(input('n: '))+1)))
