# Определить знак числа

number = int(input('Введите число: '))
print('Положительное' if number > 0 else 'Отрицательное' if number < 0 else 'Ноль')
