# Напишите функцию is_password_good(password),
# которая принимает в качестве аргумента строковое значение пароля
# и возвращает значение True если пароль является надежным и False в противном случае.
#
# Пароль является надежным если:
# 1) его длина не менее 88 символов;
# 2) он содержит как минимум одну заглавную букву (верхний регистр);
# 3) он содержит как минимум одну строчную букву (нижний регистр);
# 4) он содержит хотя бы одну цифру.

# объявление функции
def is_password_good(password):
    pass


# считываем данные
txt = input()

# вызываем функцию
print(is_password_good(txt))
